In [12]:
import numpy as np
import pandas as pd

if np.nan:
    print(np.nan, "!")
    print(type(np.nan))

nan !
<class 'float'>

In [13]:
pd.isnull(np.nan)

True

In [18]:
df = pd.DataFrame({1: [1, 2, 3, 4, 5],
     2: [2, 4, 6, 8, 10],
     3: [3, 6, 9, 12, 15]})

In [23]:
df.drop([1, 2], axis = 0)

   1   2   3
0  1   2   3
3  4   8  12
4  5  10  15